
#include "stm32f10x.h"
//#include "system_conf.h"
//#include "FreeRTOS.h"

#define TEMPER_MIN	-200
#define TEMPER_MAX	1200
#define TEMPERLIST_LENGTH	((TEMPER_MAX - TEMPER_MIN)/10 + 1)

#ifndef TT_NTC_VALUE
#define TT_NTC_VALUE	10000
#endif

#if TT_NTC_VALUE == 20000
//NTC 20K 温度表
const uint16_t r20klist[] = {
19568,18460,17422,16449,15537,14680,13876,13122,12412,11746,//-20~-11
11119,10530, 9975, 9453, 8961, 8498, 8062, 7650, 7262, 6896,//-10~-1
6551,6225,5917,5626,5351,5091,4845,4613,4393,4185,//0-9
3988,3801,3624,3456,3297,3146,3003,2868,2739,2616,//10-19
2500,2390,2285,2185,2090,2000,1914,1833,1755,1681,//20-29
1610,1543,1479,1418,1360,1304,1252,1201,1153,1107,//30-39
1063,1021,981,943,906,871,838,806,775,746,//40-49
718,691,665,641,617,594,573,552,532,513,//50-59
495,477,460,444,429,414,399,386,372,360,//60-69
348,336,325,314,303,293,284,274,266,257,//70-79
249,241,233,226,218,212,205,199,192,187,//80-89
181,175,170,165,160,155,150,146,142,138,//90-99
134,130,126,122,119,115,112,109,106,103,//100-110
100,97,95,92,89,87,85,82,80,78,//111-119
76,//120
};

const uint16_t *ptr_templist = r20klist;
#elif TT_NTC_VALUE == 10000
const uint16_t r10klist[] = {
7003,	6666,	6347,	6045,	5760,	5489,	5233,	4990,	4760,	4542,//-20--11
4335,	4138,	3952,	3775,	3607,	3448,	3296,	3152,	3016,	2885,//-10--1
2762,	2644,	2532,	2425,	2323,	2227,	2134,	2046,	1963,	1883,//0-0
1807,	1734,	1665,	1598,	1535,	1475,	1417,	1362,	1309,	1259,//10-19
1211,	1165,	1121,	1079,	1039,	1000,	963,	928,	894,	861,//20-29
830,	800,	772,	744,	718,	693,	669,	645,	623,	602,//30-39
581,	561,	542,	524,	507,	490,	473,	458,	443,	428,//40-49
415,	401,	388,	376,	364,	353,	342,	330,	321,	311,//50-59
301,	292,	283,	274,	266,	258,	251,	243,	236,	229,//60-69
222,	216,	210,	204,	198,	192,	187,	181,	176,	171,//70-79
167,	162,	158,	153,	149,	145,	141,	137,	134,	130,//80-89
127,	124,	120,	117,	114,	111,	108,	106,	103,	100,//90-99
98,		95,		93,		90,		88,		86,		84 ,	82 ,	80 ,	78 ,//100-109
76 ,	75 ,	73 ,	71 ,	70 ,	68 ,	66 ,	65 ,	63 ,	62 ,//110-119// Add in 2011-10-09
60// 120
/*//原数据
65535,	64480,	63470,	60450,	57600,	54890,	52330,	49900,	47600,	45420,//-20--11
43350,	41380,	39520,	37750,	36070,	34480,	32960,	31520,	30160,	28850,//-10--1
27620,	26440,	25320,	24250,	23230,	22270,	21340,	20460,	19630,	18830,//0-0
18070,	17340,	16650,	15980,	15350,	14750,	14170,	13620,	13090,	12590,//10-19
12110,	11650,	11210,	10790,	10390,	10000,	9631,	9277,	8938,	8613,//20-29
8302,	8004,	7718,	7444,	7180,	6928,	6686,	6454,	6230,	6016,//30-39
5810,	5613,	5423,	5240,	5065,	4897,	4734,	4578,	4429,	4284,//40-49
4145,	4012,	3883,	3759,	3640,	3525,	3415,	3303,	3205,	3106,//50-59
3011,	2919,	2830,	2744,	2662,	2582,	2505,	2431,	2359,	2290,//60-69
2223,	2158,	2096,	2036,	1978,	1921,	1867,	1814,	1764,	1714,//70-79
1667,	1621,	1576,	1533,	1492,	1451,	1412,	1374,	1338,	1302,//80-89
1268,	1235,	1203,	1171,	1141,	1112,	1083,	1056,	1029,	1003,//90-99
977,	953,	930,	906,	884,	863,	842,	821,	801,	782,//100-109
763,	745,	728,	710,	694,	678,	662,	647,	632,	617,//110-119// Add in 2011-10-09
603// 120*/
};
const uint16_t *ptr_templist = r10klist;
#else
const uint16_t r10klist[] = {
7003,	6666,	6347,	60450,	5760,	5489,	5233,	4990,	4760,	4542,//-20--11
4335,	4138,	3952,	3775,	3607,	3448,	3296,	3152,	3016,	2885,//-10--1
2762,	2644,	2532,	2425,	2323,	2227,	2134,	2046,	1963,	1883,//0-0
1807,	1734,	1665,	1598,	1535,	1475,	1417,	1362,	1309,	1259,//10-19
1211,	1165,	1121,	1079,	1039,	1000,	963,	928,	894,	861,//20-29
830,	800,	772,	744,	718,	693,	669,	645,	623,	602,//30-39
581,	561,	542,	524,	507,	490,	473,	458,	443,	428,//40-49
415,	401,	388,	376,	364,	353,	342,	330,	321,	311,//50-59
301,	292,	283,	274,	266,	258,	251,	243,	236,	229,//60-69
222,	216,	210,	204,	198,	192,	187,	181,	176,	171,//70-79
167,	162,	158,	153,	149,	145,	141,	137,	134,	130,//80-89
127,	124,	120,	117,	114,	111,	108,	106,	103,	100,//90-99
98,		95,		93,		90,		88,		86,		84 ,	82 ,	80 ,	78 ,//100-109
76 ,	75 ,	73 ,	71 ,	70 ,	68 ,	66 ,	65 ,	63 ,	62 ,//110-119// Add in 2011-10-09
60// 120
};
const uint16_t *ptr_templist = r10klist;
#endif


s16 Temps[10];

//温度查表函数,返回温度值-10~110,*10
//温度表名:const u16 r20klist[]
//T95 T40 为校温参数
s16 temper_trans(u16 resistor, s16 T95, s16 T40)
{
 //u16 const *p_temper;
 s16 i;//,j,temp;
 s32 temperature;
 u16 viewi,viewj;
 i = 0;
 //j = 119;
// p_temper = temper;
 //if((adc > 3500) || (adc < 150))
 if((resistor > 60000) || (resistor < 350))
   return 1500;
 if(resistor > ptr_templist[0])//超出最低温度,返回-11.0
   return TEMPER_MIN - 1;
 else if(resistor < ptr_templist[TEMPERLIST_LENGTH - 1])//超出最高温度,返回111.0
   return (TEMPER_MAX + 1);
   
 for(i = 0;i < TEMPERLIST_LENGTH;i ++)
 {
  if(resistor <= ptr_templist[i])
  {
   	if(resistor >= ptr_templist[i + 1])
	{
	 break;
	}
  }	 
 }
 //PRINTF("R:%d,Loc:%d\r\n",resistor,i);
 //if(i >= 119)
 //	  NOP();
 //if(resistor == temper[i])
 //  return (s16)i*10;
 //else if(resistor == temper[i + 1])
 //  return (s16)(i + 1)*10;
 //else
 //{
  viewi = ptr_templist[i];
  viewj = ptr_templist[i + 1];
  temperature = (s32)(resistor - viewj)*10;
  temperature = temperature/(viewi - viewj);
  temperature = (s32)(i + 1)*10 - temperature + TEMPER_MIN;
  
  temperature = (temperature - 400)*(T95 - T40)/550 + T40;
 //}
 return (s16)temperature;
}

//将电压值换算为电阻值的函数
#define RU 1500//串连在传感器上方的电阻阻值,单位为10欧姆
u16 ad_to_resistor(u16 adc)
{
 u32 resistor;
 if((adc > 3500) || (adc < 150))
 	return 0;
 resistor = (u32)adc * RU;
 resistor = resistor/(4096 - adc);
 return (u16)resistor;
}

/*-------------------------------------------------------------
 输入ADC数值,将之转换成为温度值,温度表见r20klist[]
-------------------------------------------------------------*/
s16 GetTemp(u16 adcvalue)
{
	adcvalue = ad_to_resistor(adcvalue);
	return temper_trans(adcvalue,950,400);
}

#if 0
#define TEMPFIFOLENGTH 64
//温度队列
s16 TempFIFO[3][TEMPFIFOLENGTH];
//u8 TempFIFOCT[3];

void CalcTempInit(s16 * pBlockTemp)
{
 u8 i;
 u8 j;
 
 for(i = 0;i < 3;i ++)
 {
  for(j = 0;j < TEMPFIFOLENGTH;j ++)
  {
   TempFIFO[i][j] = pBlockTemp[i];
  }
 }
}

void CalcTempFIFOIn(s16 * pBlockTemp)
{
 u8 i;
 
 for(i = 0;i < 3;i ++)
 {
  if((pBlockTemp[i] > 1200) || (pBlockTemp[i] < -100))
   continue;
  memcpy(&TempFIFO[i][0],&TempFIFO[i][2],(TEMPFIFOLENGTH - 1)*2);
  TempFIFO[i][TEMPFIFOLENGTH - 1] = pBlockTemp[i];
 }
}



 /*
void GetCalcTemp_1(float * pCalcTemp,s16 * pBlockTemp, s16 * pTargetTemp[])
{
 //u8 i;
 //s16 TempError;
 static float Temp;
 
 
}
   */
void GetCalcTemp(float * pCalcTemp,s16 * pBlockTemp, s16 * pTargetTemp[])
{
 u8 i;
 s16 TempError;
 static float Temp;
 
 for(i = 0;i < 3;i ++)
 {
  if(pCalcTemp[i + 3] == 9999)
  {
   pCalcTemp[i + 3] = pBlockTemp[i];
  }
  //else
  //{
  if(*pTargetTemp[i] == 9999)
  {
   Temp = 1;
  }
  else
  {
   if(pTargetTemp[i][1] < 9999)
    TempError = abs(pTargetTemp[i][1] - pBlockTemp[i]) + 1;
   else
    TempError = abs(*pTargetTemp[i] - pBlockTemp[i]) + 1;
  }
  Temp = CALC_PARA;
  //if(TempError > 5)Temp = CALC_PARA;
  //else if(Temp > TempError)
  //{
  // if(Temp > 1)
  //	  Temp --;
  //}
   pCalcTemp[i] = pCalcTemp[i + 3] + (pBlockTemp[i] - pCalcTemp[i + 3])/Temp;
  //}
  pCalcTemp[i + 3] = pCalcTemp[i];
 }
 
}
#endif


